## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_pet.rg_name will be created
  + resource "random_pet" "rg_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "rg"
      + separator = "-"
    }

  # module.azure_cognitive_account.azurerm_cognitive_account.aoai_account will be created
  + resource "azurerm_cognitive_account" "aoai_account" {
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = "azurecognitive01"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.azure_openai_deployment.azurerm_cognitive_deployment.aoai_deployment will be created
  + resource "azurerm_cognitive_deployment" "aoai_deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gmezanopenai01"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o-mini"
          + version = "2024-07-18"
        }

      + sku {
          + capacity = 1
          + name     = "Standard"
          + tier     = "Free"
        }
    }

  # module.resource_group.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>